using System;

namespace ComplexNumbers
{
    //Скворцов А.В.
    //а) Дописать структуру Complex, добавив метод вычитания комплексных чисел. Продемонстрировать работу структуры.
    //б) Дописать класс Complex, добавив методы вычитания и произведения чисел.Проверить работу класса.
    //в) Добавить диалог с использованием switch демонстрирующий работу класса
    class Program
    {
        static void Main(string[] args)
        {
            Menu menu = new();
            menu.Start();
        }
    }
}
